Tekla.Structures.Model.Solid.SolidReturnValueEnum
Solid return value enumeration.

Tekla.Structures.Model.Solid.SolidReturnValueEnum.SOLID_RET_FAILURE
Return failure.

Tekla.Structures.Model.Solid.SolidReturnValueEnum.SOLID_RET_CONTINUE_CURRENT_LOOP
Return continue current loop.

Tekla.Structures.Model.Solid.SolidReturnValueEnum.SOLID_RET_CONTINUE_NEXT_LOOP
Return continue next loop.

Tekla.Structures.Model.Solid.SolidReturnValueEnum.SOLID_RET_CONTINUE_NEXT_FACE
Return continue next face.

Tekla.Structures.Model.Solid.SolidReturnValueEnum.SOLID_RET_CONTINUE_NEXT_EDGE
Return continue next edge.

Tekla.Structures.Model.Solid.SolidReturnValueEnum.SOLID_RET_SOLID_COMPLETE
Return solid complete.